<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -var-file=/home/runner/work/testpr-infra/testpr-infra/env/testpr_dev_uksouth/testpr_dev_uksouth.tfvars
```
<!-- placeholder-2 -->

<details><summary>Diff of 6 changes.</summary>

```diff
+ module.avm-ptn-aiml-ai-foundry.azapi_resource.ai_foundry will be created
+ module.avm-ptn-aiml-ai-foundry.modtm_telemetry.telemetry[0] will be created
+ module.avm-ptn-aiml-ai-foundry.random_string.resource_token will be created
+ module.avm-ptn-aiml-ai-foundry.random_uuid.telemetry[0] will be created
+ module.avm-ptn-aiml-ai-foundry.module.avm_utl_regions.modtm_telemetry.telemetry[0] will be created
+ module.avm-ptn-aiml-ai-foundry.module.avm_utl_regions.random_uuid.telemetry[0] will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 6 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @mattv1vhm at 2025-08-22T19:47:02Z [(view log)](https://github.com/v1vhm/testpr-infra/actions/runs/17164547246/job/48701732675#step:6:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.avm-ptn-aiml-ai-foundry.azapi_resource.ai_foundry will be created
  + resource "azapi_resource" "ai_foundry" {
      + body                      = {
          + identity   = {
              + type = "SystemAssigned"
            }
          + kind       = "AIServices"
          + properties = {
              + allowProjectManagement = true
              + customSubDomainName    = (known after apply)
              + disableLocalAuth       = false
              + networkAcls            = {
                  + defaultAction       = "Allow"
                  + ipRules             = []
                  + virtualNetworkRules = []
                }
              + networkInjections      = null
              + publicNetworkAccess    = "Enabled"
            }
          + sku        = {
              + name = "S0"
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "uksouth"
      + name                      = (known after apply)
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/da7f852b-9a37-4283-a8c0-de1dafd6cb1f/resourceGroups/rg-TESTPR-dev-uksouth"
      + schema_validation_enabled = false
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "Microsoft.CognitiveServices/accounts@2025-04-01-preview"
    }

  # module.avm-ptn-aiml-ai-foundry.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "location"        = "uksouth"
          + "module_source"   = "registry.terraform.io/Azure/avm-ptn-aiml-ai-foundry/azurerm"
          + "module_version"  = "0.6.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "da7f852b-9a37-4283-a8c0-de1dafd6cb1f"
          + "tenant_id"       = "b81eb8a4-9a3e-4054-a89f-882e0eae1c3d"
        }
    }

  # module.avm-ptn-aiml-ai-foundry.random_string.resource_token will be created
  + resource "random_string" "resource_token" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.avm-ptn-aiml-ai-foundry.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.avm-ptn-aiml-ai-foundry.module.avm_utl_regions.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "module_source"   = "registry.terraform.io/Azure/avm-utl-regions/azurerm"
          + "module_version"  = "0.5.2"
          + "random_id"       = (known after apply)
          + "subscription_id" = "da7f852b-9a37-4283-a8c0-de1dafd6cb1f"
          + "tenant_id"       = "b81eb8a4-9a3e-4054-a89f-882e0eae1c3d"
        }
    }

  # module.avm-ptn-aiml-ai-foundry.module.avm_utl_regions.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-20-6437c9a977ca67b91f053db4585f6b9d.tfplan -->
<!-- placeholder-6 -->